%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 【階層クラスタリングによるデンドログラムについて考察する課題】                             
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% AIの機械学習（教師なし学習）：階層クラスタリング
% 測定データ: fisheriris.csv
% アヤメの花の種: setosa（1行～50行）, versicolor（51行～100行）, virginica（101行～150行）
% 特徴量: がく片の長さ（1列）,  がく片の幅（2列）,  花びらの長さ（3列）,  花びらの幅（4列）
% 正解データ：アヤメの花の種（5列）
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%


load fisheriris
iris = readtable('fisheriris.csv')
Z = linkage(meas,'average','chebychev');
T = cluster(Z,'cutoff',1.5,'Criterion','distance');
dendrogram(Z,0)
fontsize(gca,7,"pixels")
hold on; yline(1.5,'--k') 


%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% ３つの葉ノードに含まれる番号（1～150）をコマンドウィンドウに表示する。
% アヤメの花の種: setosa（1～50）, versicolor（51～100）, virginica（101～150）
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

Middle_LeafNode = find(T==1)
Right_LeafNode = find(T==2)
Left_LeafNode = find(T==3)

