%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 【階層クラスタリングで分類した散布図】（横軸：花びらの長さ，縦軸：花びらの幅）を表示する課題  
%  Lesson2_HW_Q2_1.mを参考にして、自分でプログラムを作成する。                                  
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% AIの機械学習（教師なし学習）：階層クラスタリング
% 測定データ: fisheriris.csv
% アヤメの花の種: setosa（1行～50行）, versicolor（51行～100行）, virginica（101行～150行）
% 特徴量: がく片の長さ（1列）,  がく片の幅（2列）,  花びらの長さ（3列）,  花びらの幅（4列）
% 正解データ：アヤメの花の種（5列）
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

load fisheriris

Z = linkage(meas,'average','chebychev');
T = cluster(Z,'cutoff',1.5,'Criterion','distance');
length(unique(T));

gscatter(meas(:,3),meas(:,4),T,'brg','+od')
axis([0 8 0 5])
title("階層クラスタリングによる分類")
xlabel("花びらの長さ [cm]")
ylabel("花びらの幅 [cm]")


