%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 【座る・立つ・歩くの動作のデンドログラム】
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% AIの機械学習（教師なし学習）：階層クラスタリング
% 測定データ「humanactivity.mat」
% 座る・立つ・歩くの動作についての加速度データ
% 正解データ「actid」: 座る(1), 立つ(2), 歩く(3)  actid(4030:6520,1)
% 特徴量「feat」: 加速度のx成分の平均値（1列） feat(4030:6520,1)
% 　　　　　　　　加速度のy成分の平均値（2列） feat(4030:6520,2)
% 　　　　　　　　加速度のz成分の平均値（3列） feat(4030:6520,3)
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%



load humanactivity.mat
Z = linkage(feat(4030:6520,1:3),'average','chebychev');
T = cluster(Z,'cutoff',0.1165,'Criterion','distance');
dendrogram(Z,0)
fontsize(gca,14,"pixels")
hold on; yline(0.1165,'--k') 
xticks([])

