%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 【座る・立つ・歩くの動作の散布図】
%   横軸：加速度のx成分の平均値  feat(4030:6520,1)  '$ \bar{a}_x$'
%   縦軸：加速度のz成分の平均値  feat(4030:6520,3)  '$ \bar{a}_z$'  
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% AIの機械学習（教師なし学習）：階層クラスタリング
% 測定データ「humanactivity.mat」
% 座る・立つ・歩くの動作についての加速度データ
% 正解データ「actid」: 座る(1), 立つ(2), 歩く(3)  actid(4030:6520,1)
% 特徴量「feat」: 加速度のx成分の平均値（1列） feat(4030:6520,1)
% 　　　　　　　　加速度のy成分の平均値（2列） feat(4030:6520,2)
% 　　　　　　　　加速度のz成分の平均値（3列） feat(4030:6520,3)
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%



load humanactivity.mat
gscatter(feat(4030:6520,1), feat(4030:6520,3), actid(4030:6520,1), 'mrb', 'o+.')
xlabel('$ \bar{a}_x$','FontSize',14,'Interpreter','latex')
ylabel('$ \bar{a}_z$','FontSize',14,'Interpreter','latex')
hold on; xline(0,'--k'); hold on; yline(mean(feat(5677:6520,3)),'--k'); hold off; 
legend('座る','立つ','歩く','Location','northeast')
